Repository: AlexP11223/KVIrc
Catalog: po/modules/dcc/dcc_*.po
Languages: ca

source: unknown
ca: desconegut

source: Choose Files to Send - KVIrc
ca: Esculli els Arxius a Enviar - KVIrc

source: <b>%1 [%2@%3]</b> requests a <b>Direct Client Connection</b> in <b>%4</b> mode.<br>
ca: <b>%1 [%2@%3]</b> demana una <b>Connexió Directa a Client (DCC)</b> en mode <b>%4</b><br>

source: The connection will be secured using SSL.<br>
ca: La connexió serà assegurada emprant SSL.<br>

source: The connection target will be host <b>%1</b> on port <b>%2</b><br>
ca: El destí de la connexió serà la màquina <b>%1</b> en el port <b>%2</b><br>

source: DCC %1 Request - KVIrc
ca: Petició DCC %1 - KVIrc

source: <b>%1 [%2@%3]</b> requests a<br><b>Direct Client Connection</b> in <b>VOICE</b> mode.<br>The connection target will be host <b>%4</b> on port <b>%5</b><br>
ca: <b>%1 [%2@%3]</b> peticions a<br><b>Connexió Directa a Client (DCC)</b> en modo <b>VOICE</b>.<br>El destí de la connexió serà la màquina <b>%4</b> en el port <b>%5</b><br>

source: DCC VOICE request
ca: Petició de DCC VOICE

source: <b>%1 [%2@%3]</b> requests a<br><b>Direct Client Connection</b> in <b>CANVAS</b> mode.<br>The connection target will be host <b>%4</b> on port <b>%5</b><br>
ca: <b>%1 [%2@%3]</b> peticions a<br><b>Connexió Directa a Client (DCC)</b> en mode <b>CANVAS</b>.<br>El destí de la connexió serà la màquina <b>%4</b> en el port <b>%5</b><br>

source: DCC CANVAS request
ca: Petició de DCC CANVAS

source: <center><b>Note:</b></center>The file appears to be an avatar that you have requested. You should not change its filename. Save it in a location where KVIrc can find it, such as the 'avatars', 'incoming', or 'pics' directories, your home directory, or the save directory for the incoming file type. The default save path will probably work. You can instruct KVIrc to accept incoming avatars automatically by setting the option <tt>boolAutoAcceptIncomingAvatars</tt> to true.<br>
ca: <center><b>Nota:</b></center>El arxiu sembla ser un avatar que ha solicitat. No hauria de canviar el nom de l'arxiu. Guardi-ho en un lloc on pugui trobar-lo KVIrc, com els directoris 'avatars', 'incoming' o 'pics' del teu directori personal o en el directori de gravació pel tipus d'arxiu entrant. Provablement, la ruta de gravació per defecte funcionarà. Pot demanar a KVIrc que accepti avatars automàticament activant l'opció <tt>Acceptar automàticament avatars entrants</tt>.<br>

source: Attempting a passive DCC %s connection
ca: Intentant una connexió %s DCC pasiva

source: Attempting an active DCC %s connection
ca: Intentant una connexió %s DCC activa

source: The local IP address is private, determining from IRC server: %s
ca: L'adreça IP local és privada, determinant des del servidor IRC: %s

source: The local IP address is private, but unable to determine it from the IRC server
ca: L'adreça IP local és privada, però és impossible determinar-la des del servidor IRC

source: The local IP address is private, but have no IRC server to determine it from
ca: L'adreça IP local és privada, però no tinc un servidor IRC des d'on determinar-la

source: Low-level transport connection established
ca: Establerta la connexió de transport de baix nivell

source: Starting Secure Socket Layer handshake
ca: Iniciant negociació del protocol SSL

source: [SSL ERROR]: %s
ca: [ERROR SSL]: %s

source: Cannot send data: No active connection
ca: No puc enviar dades: No hi ha una connexió activa

source: WARNING: failed to check the soundcard duplex capabilities: if this is a half-duplex soundcard , use the DCC VOICE option to force half-duplex algorithm
ca: ATENCIO: ha fallat la comprovació de la característica duplex de la tarja de so: si aquesta és una tarja half-duplex, empra l'opció DCC VOICE per a forçar l'algoritme half-duplex

source: Half duplex soundcard detected, you will not be able to talk and listen at the same time
ca: Detectada tarja de so half-duplex, no seràs capaç de parlar i escoltar al mateix temps

source: WARNING: failed to set the requested sample rate (%d): the device used closest match (%d)
ca: ATENCIO: ha fallat la configuració de la freqüència de mostreig solicitada (%d): el dispositiu ha emprat el valor més proper (%d)

source: Ops...failed to test the soundcard capabilities...expect problems...
ca: Ups...ha fallat la prova de les capacitats de la tarja de so...pots esperar problemes

source: Input buffer
ca: Buffer d'entrada

source: Output buffer
ca: Buffer de sortida

source: Attempting a passive DCC VOICE connection
ca: Intentant una connexió pasiva DCC VOICE

source: Attempting an active DCC VOICE connection
ca: Intentant una connexió activa DCC VOICE

source: DCC VOICE request not sent: awaiting manual connections
ca: No s'ha enviat la petició DCC: esperant connexions manuals

source: Input buffer: %d bytes
ca: Buffer d'entrada: %d bytes

source: Output buffer: %d bytes
ca: Buffer de sortida: %d bytes

source: DCC Failed: %Q
ca: Ha fallat el DCC: %Q

source: Actual codec used is '%s'
ca: El còdec actual és '%s'

source: Volume: %i
ca: Volum: %i

source: This window has no associated IRC context (an IRC context is required unless -c or -n are passed)
ca: Aquesta finestra no té context IRC associat (es necessita un context IRC a menys que es passin els modificadors -c o -n)

source: You're not connected to a server (an active connection is required unless -c or -n are passed)
ca: No està connectat a un servidor (es necessita una connexió activa a menys que es passin els modificadors -c o -n)

source: No suitable interfaces to listen on, use -i
ca: No hi ha interfícies adequades per a escoltar, empra -i

source: This executable was built without SSL support, -s switch ignored
ca: Aquest executable s'ha construït sense suport SSL, el modificador -s serà ignorat

source: -c requires -i and -p
ca: -c necessita -i i -p

source: <unknown size>
ca: <mida desconeguda>

source: This executable has been built without SSL support, -s switch ignored
ca: Aquest executable ha estat construït sense suport SSL, el modificador -s serà ignorat

source: This executable has no SSL support, -s switch ignored
ca: Aquest executable no té suport SSL, modificador -s ignorat

source: The current window has no associated DCC session
ca: La finestra actual no té una sessió DCC associada

source: The specified parameter is not a valid DCC identifier
ca: El paràmetre especificat no és un identificador DCC vàlid

source: The specified window identifier is not valid
ca: L'identificador de finestra especificat no és vàlid

source: WARNING: The peer is sending garbage data past the end of the file
ca: ATENCIO: El altre extrem està enviant dades escombraria passant el final de l'arxiu

source: WARNING: Ignoring data past the declared end of file and closing the connection
ca: ATENCIO: Ignorant les dades que excedeixen del final d'arxiu declarat i tancant la connexió

source: Data transfer terminated, waiting 30 seconds for the peer to close the connection...
ca: Transferència de dades acabada, esperant 30 segons per a que l'altre extrem tanqui la connexió...

source: Data transfer was terminated 30 seconds ago, closing the connection
ca: La transferència de dades ha acabat fa 30 segons, tancant la connexió

source: WARNING: Received data in a DCC TSEND, there should be no acknowledges
ca: ATENCIO: Rebent dades en un DCC TSEND, aquí no hauria d'haver confirmacions

source: TRANSFER %d
ca: TRANSFERIR %d

source: Setting up the connection
ca: Configurant la connexió

source: Attempting a passive DCC %1 connection
ca: Intentant una connexió DCC pasiva %1

source: Attempting an active DCC %1 connection
ca: Intentant una connexió DCC activa %1

source: Sent DCC RESUME request to %1, waiting for ACCEPT
ca: Enviada petició DCC RESUME a %1, esperant el ACCEPT

source: Aborted
ca: Interrumpuda

source: Transfer failed:
ca: Ha fallat la transferència:

source: Abort
ca: Interrompre

source: From:
ca: Des de:

source: To:
ca: A:

source: Transfer Log
ca: Registre de Transferència

source: Contacting host %1 on port %2
ca: Contactant amb la màquina %1 en el port %2

source: Listening on interface %1 port %2
ca: Escoltant en la interfície %1 port %2

source: The local IP address is private, determining from IRC server: %1
ca: L'adreça IP local és privada, determinant-la des del servidor IRC: %1

source: Sent DCC %1 request to %2, waiting for remote client to connect...
ca: Enviada petició DCC %1 a %2, esperant la connexió des del client remot...

source: DCC %1 request not sent, awaiting manual connection
ca: Petició DCC %1 no enviada, esperant connexió manual

source: [SSL ERROR]: %1
ca: [ERROR SSL]: %1

source: Transfer completed
ca: Transferència completada

source: Connected to %1:%2
ca: Conectat a %1:%2

source: Local end is %1:%2
ca: El extrem local és %1:%2

source: Transferring data
ca: Transferint dades

source: RESUME accepted, transfer will begin at position %1
ca: S'ha acceptat RESUME, la transferència s'iniciarà a la posició %1

source: Internal error in RESUME request
ca: Error intern a la petició RESUME

source: Invalid RESUME request: Position %1 is larger than file size
ca: Petició RESUME no vàlida: la posició %1 és major que la mida de l'arxiu

source: Accepting RESUME request, transfer will begin at position %1
ca: Acceptant petició RESUM, la transferència començara a la posició %1

source: Cancel
ca: Cancel·lar

source: Attempting a passive DCC CANVAS connection
ca: Intentant una connexió pasiva DCC CANVAS

source: DCC CANVAS request not sent: awaiting manual connections
ca: Petició DCC CANVAS no enviada; esperant connexions manuals

source: Attempting an active DCC CANVAS connection
ca: Intentant una connexió DCC CANVAS activa

source: &Line
ca: &Línia

source: &Ellipse
ca: &Elipse

source: &Pie
ca: Pastís

source: &Chord
ca: A&cord

source: &Rich text (html)
ca: Text en&riquit (html)

source: &Shape
ca: Figura

source: &Item
ca: Element

source: &Polygons
ca: &Polígons

source: &Insert
ca: &Inserir

source: Ignoring and notifying failure
ca: Ignorant i notificant l'errada

source: Ignoring
ca: Ignorant

source: Concurrent transfer limit reached (%u of %u transfers running)
ca: Arribant al límit de transferències concurrents (%u de %u transferències funcionant)

source: Slot limit reached (%u slots of %u)
ca: Arribat al límit d'slots (%u slots de %u)

source: Too many pending connections
ca: Masses connexions pendents

source: Invalid port number %s
ca: Número de port no vàlid %s

source: Invalid IP address in old format %s
ca: L'adreça IP en format antic no és vàlida %s

source: Invalid IP address %s
ca: Adreça IP no vàlida %s

source: The above request is broken: The second parameter is '%s' and should be 'chat', trying to continue
ca: La petició anterior no és connecta: el segon paràmetre és '%s' i hauria de ser xat, intentant continuar

source: This executable has been compiled without SSL support, the SSL extension to DCC CHAT is not available
ca: Aquest executable ha estat compilat sense suport SSL, no està disponible l'extenssió per a DCC CHAT

source: The above request is broken: The fourth parameter should be the file size but does not appear to be an unsigned number, trying to continue
ca: La petició anterior no es connecta: el quart paràmetre hauria de ser la mida de l'arxiu però no sembla ser un número enter sense signe, intentant continuar

source: The above request is broken: The filename contains path components, stripping the leading path and trying to continue
ca: La petició anterior no és correcta: el nom de l'arxiu conté una ruta, traient la ruta i intentant continuar

source: This executable has been compiled without SSL support, the SSL extension to DCC SEND is not available
ca: Aquest executable ha estat compilat sense suport SSL, no està disposable l'extenssió per a DCC SEND

source: Can't proceed with DCC RECV: Transfer not initiated for file %s on port %s
ca: No puc realitzar el DCC REVC: la transferència de l'arxiu %s en el port %s no s'ha iniciat

source: Invalid resume position argument '%s'
ca: L'argument de posició de resum '%s' no és vàlid

source: Can't proceed with DCC SEND: Transfer not initiated for file %s on port %s, or invalid resume size
ca: No he pogut realitzar en DCC SEND: la transferència de l'arxiu %s en el port %s no s'ha iniciat o té una mida de resum no vàlida

source: The above request has resume file size missing, assuming a resume file size of 0
ca: La petició anterior no té una mida d'arxiu per a continuar, assumint 0 com a mida d'arxiu de reanudació

source: This executable has been compiled without SSL support, the SSL extension to DCC RECV is not available
ca: Aquest executable ha estat compilat sense suport SSL, no està disponible l'extensió SSL per a DCC RECV

source: Invalid RECV request: Position %u is is larger than file size
ca: Petició RECV no vàlida: la posició %u és més gran que la mida de l'arxiu

source: %Q [%Q@%Q] is ready to receive the file "%s"
ca: %Q [%Q@%Q] està preparat per a rebre l'arxiu "%s"

source: The remote client is listening on interface %s and port %s
ca: El client remot està escoltant en la interfície %s i port %s

source: Use %c![!dbl]dcc.send %s -i=%s -p=%s %Q/dcc.send %s -i=%s -p=%s %Q%c to send the file (or double-click on the socket)
ca: Emprar %c![!dbl]dcc.send %s -i=%s -p=%s %Q/dcc.send %s -i=%s -p=%s %Q%c per a enviar l'arxiu (o doble click al socket)

source: The above request is broken: The fourth parameter should be the file size but does not appear to be an unsigned number; trying to continue
ca: La petició anterior és errònia: el quart paràmetre hauria de ser la mida de l'arxiu però no sembla ser un enter sense signe;intentant continuar

source: This executable has been compiled without SSL support, the SSL extension to DCC RSEND is not available
ca: Aquest executable ha estat compilat sense suport SSL, no està disponible l'extensió SSL per a DCC RSEND

source: (unknown)
ca: (desconegut)

source: No suitable interface to listen on, trying to continue anyway...
ca: No hi ha una interfície adequant en el que escoltar, intentant continuar de totes formes...

source: This executable has been compiled without SSL support, the SSL extension to DCC GET is not available
ca: Aquest executable ha estat compilat sense suport SSL, no està disponible l'extensió per a DCC GET

source: No file offer named '%s' (with size %s) available for %Q [%Q@%Q]
ca: No hi ha una oferta de l'arxiu '%s' (amb mida %s) disponible per a %Q [%Q@%Q]

source: "any"
ca: "qualsevol"

source: Accepting file request from %Q [%Q@%Q] for '%s' (real file: %Q), offering DCC %s since we can't accept incoming connections (user option)
ca: Acceptant una petició d'arxiu des de %Q [%Q@%Q] per a '%s' (arxiu real: %Q), oferint DCC %s perque no podem acceptar connexions entrants (opció d'usuari)

source: The above request cannot be accepted: Unsupported codec '%s'
ca: La petició anterior no pot ser acceptada: còdec no suportat '%s'

source: The above request appears to be broken: Invalid sample-rate '%s', defaulting to 8000
ca: La petició anterior sembla errònia: freqüència de motreig '%s' no vàlida, posant a 8000 per defecte

source: Unknown DCC type '%s'
ca: Tipus DCC desconegut '%s'

source: &Accept
ca: &Acceptar

source: &Reject
ca: &Rebutjar

source: &Rename
ca: &Renombrar

source: Over&write
ca: Sobreescriure

source: Re&sume
ca: Continuar

source: File Already Exists - KVIrc
ca: L'Arxiu Ja Existeix - KVIrc

source: Can't retrieve a suitable local IPV4 address
ca: No puc trobar una adreça IPv4 apropiada

source: Can't listen on default interface '%s': fix it in the options dialog, disabling the option (so the next dcc will work)
ca: No puc escoltar en la interfície per defecte '%s': arregla-ho en el diàleg d'opcions deshabilitant l'opció (per a que funcioni el pròxim dcc)
