Repository: AlexP11223/KVIrc
Catalog: po/modules/logview/logview_*.po
Languages: fr

source: Browse &Log Files
fr: Naviguer dans les &Journaux

source: Log File
fr: Journal

source: Filter
fr: Filtre

source: Show channel logs
fr: Afficher les logs de salons

source: Show query logs
fr: Afficher les logs de privés

source: Show console logs
fr: Afficher les logs de console

source: Show DCC chat logs
fr: Afficher les logs de DCC chat

source: Show other logs
fr: Afficher les autres logs

source: Contents filter
fr: Filtre de contenu

source: Log name mask:
fr: Masque de nom de log

source: Log contents mask:
fr: Masque de contenu de log

source: Only older than
fr: Seulement plus anciens que

source: Only newier than
fr: Seulement plus récents que

source: Apply filter
fr: Appliquer le filtre

source: Log Viewer
fr: Visualiseur de Journaux

source: Filtering files...
fr: Filtrage des fichiers...

source: Abort filtering
fr: Annuler le filtrage

source: %Q on %Q
fr: %Q sur %Q

source: Remove file
fr: Supprimer le fichier

source: Channel
fr: Salon

source: Query
fr: Privé
